Revit 2024 API
ExternalServices.BuiltInExternalServices.AlignmentService Property
 Autodesk Internal: The service for Infrastructure Alignments
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId AlignmentService { get; }
Visual Basic
Public Shared ReadOnly Property AlignmentService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ AlignmentService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace